@echo off
echo ==============================================
echo =准备编译项目，请确保本地环境安装Maven和Mysql=
echo ==============================================
pause
echo ==============================================
echo =========正在安装dcoj-judge到本地仓库=========
echo ==============================================
cd ./dcoj-judge
call mvn clean install
echo =================================================
echo =dcoj-judge安装成功，即将启动web，请勿关闭此窗口=
echo =================================================
cd ../dcoj-web
echo ==============================================
echo ==========="正在启动web应用......"============
echo ==============================================
mvn spring-boot:run
